In [1]:
import numpy as np 
import pandas as pd

In [2]:
resume_data = pd.read_csv('resume_details.csv')
job_descriptions = pd.read_csv('random_job_description.csv')

In [3]:
resume_data.head()

,resume_id,Category,Skills,Education
0,10554236,accountant accountant,accounting general accounting accounts payable...,northern community college 1994 associate acco...
1,10674770,accountant staff accountant,accounting accounts payable accounts receivabl...,bachelor science accounting 2010 university no...
2,11163645,accountant accountant,accounts payables accounts receivables account...,computer applications specialist certificate p...
3,11759079,accountant senior accountant,accounting balance sheet budgets client client...,emory university goizueta business school 5 20...
4,12065211,accountant senior accountant,aderantcms excel quickbooks pro sql access pea...,bachelor business administration accounting au...